Revit 2026 API

# ElementParameterFilter(IListFilterRule) Constructor

---

Initializes a new instance of the ElementParameterFilter class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementParameterFilter(
	IList<FilterRule> filterRules
)
```
```vb
Public Sub New (
	filterRules As IList(Of FilterRule)
)
```
```cpp
public:
ElementParameterFilter(
	IList<FilterRule^>^ filterRules
)
```
```fsharp
new :
        filterRules : IList<FilterRule> -> ElementParameterFilter
```

#### Parameters

filterRules IListFilterRule

#### Reference

ElementParameterFilter Class

ElementParameterFilter Overload

Autodesk.Revit.DB Namespace